package e

const (
	//http状态码
	SUCCESS             = 200 //请求成功
	INVALID_PARAMS      = 400 //请求参数有误
	USER_NOT_AUTH       = 401 //当前请求需要用户验证
	USER_NOT_PERMISSION = 403 //服务器已经理解请求，但是拒绝执行它。没有权限
	NOT_FOUND           = 404 //请求失败，请求所希望得到的资源未被在服务器上发现
	INTERSERVER_ERROR   = 500 //服务器异常

	//错误码
	//api类错误码10000~19999
	//用户10000~10009
	USER_NOT_EXIST = 10000 //用户信息不存在
	USER_ADD_FAIL  = 10001 //用户添加失败
	//文章10020~10029

	//评论10030~10039

	//上传10040~10049

	//链接10050~10059

	//数据库类错误码20000~29999

	//权限认证类错误30000~39999

)
